TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_ПрибытиеСуднаНаПЛК/гкс_ПрибытиеСуднаНаПЛК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_ПрибытиеСуднаНаПЛК</name>
  <basedOn>Document.гкс_Фрахт</basedOn>
  <registerRecords>InformationRegister.гкс_СостоянияФрахта</registerRecords>
  <registerRecords>InformationRegister.гкс_ТранспортныеДокументыФрахта</registerRecords>
  <registerRecords>AccumulationRegister.гкс_ОбработкаСудов</registerRecords>
  <attributes>
    <name>Фрахт</name>
    <type>
      <types>DocumentRef.гкс_Фрахт</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияВеса</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТранспортныеДокументы</name>
    <attributes>
      <name>ТранспортныйДокумент</name>
      <type>
        <types>DocumentRef.гкс_ТранспортныйДокумент</types>
      </type>
    </attributes>
    <attributes>
      <name>Трюм</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВТрюме</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоДокументу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СвязьРегистрацииИТранспортногоДокумента/гкс_СвязьРегистрацииИТранспортногоДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СвязьРегистрацииИТранспортногоДокумента</name>
  <comment>Транспортные документы регистрации</comment>
  <resources>
    <name>ТранспортныйДокумент</name>
    <type>
      <types>DocumentRef.гкс_ТранспортныйДокумент</types>
    </type>
  </resources>
  <resources>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </resources>
  <resources>
    <name>ЗаявкаНаПеревозку</name>
    <type>
      <types>DocumentRef.гкс_ЗаявкаНаПеревозку</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_ТранспортныйДокумент/гкс_ТранспортныйДокумент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_ТранспортныйДокумент</name>
  <registerRecords>InformationRegister.гкс_ЖДНакладныеВагона</registerRecords>
  <attributes>
    <name>ПунктПогрузки</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПунктРазгрузки</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПогрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРазгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияПоставки</name>
    <type>
      <types>CatalogRef.гкс_УсловияПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияВеса</name>
    <comment>Ед.измерения веса в документе</comment>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоДокументПЛК</name>
    <comment>Документ создан в текущей базе</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТранспортныеСредства</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПогрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРазгрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесТары</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНетто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФИОВодителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.гкс_ЗаявкаНаПеревозку</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_ПрибытиеСуднаНаПЛК/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если ЗначениеЗаполнено(Параметры.Основание) Тогда 
		УстановитьПараметрыВыбораДляТранспортныхДокументов(Параметры.Основание);
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда 
		УстановитьПараметрыВыбораДляФрахта();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ЗаполнитьДокументыРегистрацииНаФорме();
	УстановитьПараметрыВыбораДляТранспортныхДокументов(Объект.Фрахт);
	УстановитьПараметрыВыбораДляФрахта();
	РассчитатьИтогиНаФорме();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ЗаполнитьДокументыРегистрацииНаФорме();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФрахтПриИзменении(Элемент)
	
	гкс_МорскаяЛогистикаКлиент.ЗаполнитьПрибытиеСуднаПоДаннымФрахта(ЭтотОбъект);
	УстановитьПараметрыВыбораДляТранспортныхДокументов(Объект.Фрахт);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТранспортныеДокументы

&НаКлиенте
Процедура ТранспортныеДокументыТранспортныйДокументПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТранспортныеДокументы.ТекущиеДанные;
	ТекущиеДанные.КоличествоПоДокументу = гкс_МорскаяЛогистикаКлиент.ВесПоТранспортномуДокументу(
		ТекущиеДанные.ТранспортныйДокумент);
	ТекущиеДанные.ДокументРегистрации = Неопределено;
	РассчитатьИтогиНаФорме();
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТранспортныеДокументы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле = Элементы.ТранспортныеДокументыДокументРегистрации Тогда 
		ПоказатьЗначение(Неопределено, ТекущиеДанные.ДокументРегистрации);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьРегистрацию(Команда)
	
	НачатьСозданиеДокументаРегистрации();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТранспортныеДокументы(Команда)
	гкс_МорскаяЛогистикаКлиент.ЗаполнитьПрибытиеСуднаПоДаннымФрахта(ЭтотОбъект, Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НачатьСозданиеДокументаРегистрации()
	
	Если Модифицированность Тогда
		ТекстПредупреждения = НСтр("ru = 'Для продолжения необходимо записать документ!'");
		ПоказатьПредупреждение(Неопределено, ТекстПредупреждения);
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ТранспортныеДокументы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено
		Или ЗначениеЗаполнено(ТекущиеДанные.ДокументРегистрации) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЗаполнения = ДанныеЗаполненияРегистрацииНаПЛК(Объект.Ссылка, ТекущиеДанные.ТранспортныйДокумент);
	Если ДанныеЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	гкс_ПриемкаТранспортаСлужебныйКлиент.ОткрытьФормуНовогоДокументаРегистрацияНаПЛК(
		ЭтотОбъект, ДанныеЗаполнения);
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ОбновитьДанныеНаФорме()
	Прочитать();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументыРегистрацииНаФорме()
	
	ТранспортныеДокументы = ОбщегоНазначения.ВыгрузитьКолонку(
		Объект.ТранспортныеДокументы, "ТранспортныйДокумент", Истина);
	
	МодульМенеджера = ОбщегоНазначения.ОбщийМодуль("РегистрыСведений.гкс_СвязьРегистрацииИТранспортногоДокумента");
	КоллекцияДокументов = МодульМенеджера.ДокументыРегистрацииПоТранспортнымДокументам(ТранспортныеДокументы);
	Для Каждого СтрокаДокумента Из Объект.ТранспортныеДокументы Цикл
		
		СтрокаКоллекции = КоллекцияДокументов.Найти(СтрокаДокумента.ТранспортныйДокумент, "ТранспортныйДокумент");
		Если СтрокаКоллекции = Неопределено Тогда
			СтрокаДокумента.ДокументРегистрации = Неопределено;
		Иначе
			СтрокаДокумента.ДокументРегистрации = СтрокаКоллекции.ДокументРегистрации;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеЗаполненияРегистрацииНаПЛК(ПрибытиеНаПЛК, ТранспортныйДокумент)
	
	Возврат гкс_МорскаяЛогистика.ДанныеЗаполненияРегистрацииНаПЛК(ПрибытиеНаПЛК, ТранспортныйДокумент);
	
КонецФункции

&НаСервере
Процедура УстановитьПараметрыВыбораДляТранспортныхДокументов(Фрахт)
	
	КоллекцияТранспортныхДокументов = гкс_МорскаяЛогистикаВызовСервера.КоллекцияТранспортныхДокументовПоСудну(
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Фрахт, "Судно"));
	
	НовыеЗначения = Новый ФиксированныйМассив(КоллекцияТранспортныхДокументов);
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", НовыеЗначения);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	
	Элементы.ТранспортныеДокументыТранспортныйДокумент.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораДляФрахта()
	
	КоллекцияДокументов = гкс_МорскаяЛогистикаВызовСервера.КоллекцияНеобработанныхФрахтов();
	
	НовыеЗначения = Новый ФиксированныйМассив(КоллекцияДокументов);
	НовыйПараметр = Новый ПараметрВыбора("Отбор.Ссылка", НовыеЗначения);
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НовыйПараметр);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	
	Элементы.Фрахт.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьИтогиНаФорме()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТранспортныеДокументы", Объект.ТранспортныеДокументы.Выгрузить());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТранспортныеДокументы.ТранспортныйДокумент КАК ТранспортныйДокумент,
	|	ТранспортныеДокументы.КоличествоВТрюме КАК КоличествоВТрюме
	|ПОМЕСТИТЬ ТранспортныеДокументы
	|ИЗ
	|	&ТранспортныеДокументы КАК ТранспортныеДокументы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ТранспортныйДокументТранспортныеСредства.ВесНетто) КАК ИтогоПоКоносаментам,
	|	0 КАК ИтогоПоФрахту
	|ПОМЕСТИТЬ ИтогоПромежуточный
	|ИЗ
	|	Документ.гкс_ТранспортныйДокумент.ТранспортныеСредства КАК ТранспортныйДокументТранспортныеСредства
	|ГДЕ
	|	ТранспортныйДокументТранспортныеСредства.Ссылка В
	|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ТранспортныеДокументы.ТранспортныйДокумент
	|		ИЗ
	|			ТранспортныеДокументы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	0,
	|	СУММА(ТранспортныеДокументы.КоличествоВТрюме)
	|ИЗ
	|	ТранспортныеДокументы КАК ТранспортныеДокументы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ИтогоПромежуточный.ИтогоПоКоносаментам) КАК ИтогоПоКоносаментам,
	|	СУММА(ИтогоПромежуточный.ИтогоПоФрахту) КАК ИтогоПоФрахту
	|ИЗ
	|	ИтогоПромежуточный КАК ИтогоПромежуточный";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ИтогоПоКоносаментам = 0;
		ИтогоПоФрахту = 0;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
